[
  {
    "title": "lambdarouter",
    "repoUrl": "https://github.com/mitchell/lambdarouter",
    "badges": [
      {
        "imgUrl": "https://travis-ci.org/mitchell/lambdarouter.svg?branch=master",
        "linkUrl": "https://travis-ci.org/mitchell/lambdarouter",
        "alt": "Build Status"
      },
      {
        "imgUrl": "https://api.codeclimate.com/v1/badges/7270c6c4017b36d07360/test_coverage",
        "linkUrl": "https://codeclimate.com/github/mitchelljfs/lambdarouter/test_coverage",
        "alt": "Code Coverage"
      },
      {
        "imgUrl": "https://api.codeclimate.com/v1/badges/7270c6c4017b36d07360/maintainability",
        "linkUrl": "https://codeclimate.com/github/mitchelljfs/lambdarouter/maintainability",
        "alt": "Maintainability"
      }
    ],
    "description": "This package contains a router capable of routing many AWS Lambda API gateway requests to anything that implements the aws-lambda-go Handler interface, all in one Lambda function. It plays especially well with go-kit's awslambda transport package. Check out the GoDoc Reference to see how to initialize a router and create endpoints."
  },

  {
    "title": "mjfs.us",
    "repoUrl": "https://github.com/mitchell/mjfs.us",
    "badges": [
      {
        "imgUrl": "https://travis-ci.org/mitchell/mjfs.us.svg?branch=master",
        "linkUrl": "https://travis-ci.org/mitchell/mjfs.us",
        "alt": "Build Status"
      },
      {
        "imgUrl": "https://api.codeclimate.com/v1/badges/dc70437f1490980d8e8e/maintainability",
        "linkUrl": "https://codeclimate.com/github/mitchelljfs/mjfs.us/maintainability",
        "alt": "Maintainability"
      }
    ],
    "description": "The repository for this site. I've built and rebuilt my personal website in many technologies, but these days it is a simple TypeScript React SPA. Before using TS, I put Flow up to the same task and was pleasantly surprised, but ultimately won over in other projects by TS. This site is currently hosted on S3 and cached/distributed around the US by Cloudfront. This site is also continuously deployed using TravisCI."
  },

  {
    "title": "selfpass",
    "repoUrl": "https://github.com/mitchell/selfpass",
    "badges": [],
    "description": "Selfpass is intended to be a single-user (or trusted multi-user) password manager capable of encrypting/decrypting credentials and storing them remotely through encrypted transportation. All of which is deployable locally or to popular cloud platforms such as GCP and AWS. Some of the technologies used includes, Go-Kit, gRPC, Docker, and Redis. Much more to read in the repo."
  },

  {
    "title": "sys-mgmt",
    "repoUrl": "https://github.com/mitchell/sys-mgmt",
    "badges": [],
    "description": "A minimal, cross-platform, unix-like-system management program. This program is designed to detect which programs are affiliated with the unix-like system, whether it be Debian or macOS. There are various shortcuts to common unix-like commands, such as update and upgrade (for package managers), another is poweroff or reboot."
  }
]
